framework/storage/xml/xml/cove_norelacion.xml

<?xml version="1.0" encoding="utf-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oxml="http://www.ventanillaunica.gob.mx/cove/ws/oxml/">
        <soapenv:Header>
            <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
                <wsse:UsernameToken>
                    <wsse:Username/>
                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"/>
                </wsse:UsernameToken>
            </wsse:Security>
        </soapenv:Header>
        <soapenv:Body>
            <oxml:solicitarRecibirCoveServicio>
                <oxml:comprobantes>
                    <oxml:tipoOperacion/>
                    <oxml:patenteAduanal/>
                    <oxml:fechaExpedicion/>
                    <oxml:observaciones/>
                    <oxml:rfcConsulta/>
                    <oxml:tipoFigura/>
                    <oxml:correoElectronico/>
                    <oxml:firmaElectronica>
                        <oxml:certificado/>
                        <oxml:cadenaOriginal/>
                        <oxml:firma/>
                    </oxml:firmaElectronica>
                    <oxml:numeroFacturaOriginal/>
                    <oxml:factura>
                        <oxml:certificadoOrigen/>
                        <oxml:numeroExportadorAutorizado/>
                        <oxml:subdivision/>
                    </oxml:factura>
                    <oxml:emisor>
                        <oxml:tipoIdentificador/>
                        <oxml:identificacion/>        
                        <oxml:nombre/>
                        <oxml:domicilio>
                            <oxml:calle/>
                            <oxml:numeroExterior/>
                            <oxml:numeroInterior/>
                            <oxml:colonia/>
                            <oxml:localidad/>
                            <oxml:municipio/>
                            <oxml:entidadFederativa/>
                            <oxml:pais/>
                            <oxml:codigoPostal/>
                        </oxml:domicilio>
                    </oxml:emisor>
                    <oxml:destinatario>
                        <oxml:tipoIdentificador/>
                        <oxml:identificacion/>
                        <oxml:nombre/>
                        <oxml:domicilio>
                            <oxml:calle/>
                            <oxml:numeroExterior/>
                            <oxml:numeroInterior/>
                            <oxml:colonia/>
                            <oxml:localidad/>
                            <oxml:municipio/>
                            <oxml:entidadFederativa/>
                            <oxml:pais/>
                            <oxml:codigoPostal/>
                        </oxml:domicilio>
                    </oxml:destinatario>                    
                </oxml:comprobantes>
            </oxml:solicitarRecibirCoveServicio>
        </soapenv:Body>
    </soapenv:Envelope>

